src/cf/src/InformationRegisters/ПользовательскиеМакетыПечати/ПользовательскиеМакетыПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользовательскиеМакетыПечати</name>
  <comment>Макеты печатных форм, изменённые пользователем; при включённом использовании подменяют поставляемые</comment>
  <resources>
    <name>Макет</name>
    <comment>Табличный документ, изменённый пользователем</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <comment>Печатать по изменённому макету; иначе используется поставляемый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <comment>Версия конфигурации на момент правки макета: если она младше текущей, поставляемый макет мог измениться</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Владелец макета: полное имя объекта метаданных («Документ.РеализацияТоваровУслуг») или «ОбщийМакет»</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяМакета</name>
    <comment>Имя макета в метаданных владельца</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.Каналы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛидов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ВозвратОтПокупателя/ВозвратОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратОтПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСвязанныхДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>CatalogRef.ПричиныВозвратов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ВозвратОтПокупателяНалоговый/ВозвратОтПокупателяНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратОтПокупателяНалоговый</name>
  <basedOn>Document.НалоговаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.НалоговаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>CatalogRef.ПричиныВозвратов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/CommonModules/ПечатныеФормы/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Ядро подсистемы печатных форм.
//
// Конвенция печатаемого объекта: в его модуле менеджера есть две экспортные
// процедуры - ДобавитьКомандыПечати (перечисляет печатные формы объекта) и
// Печать (формирует запрошенные печатные формы). Сам объект перечисляется в
// ОбъектыСКомандамиПечати: другого способа узнать, что у менеджера есть эти
// процедуры, во встроенном языке нет.
//
// Макет печатной формы берётся только через МакетПечатнойФормы: функция
// подставляет изменённый пользователем макет из регистра
// ПользовательскиеМакетыПечати, если его использование включено.
//
// Регистр читается и пишется под любым пользователем, у которого есть печать.
// BSLLS:SetPrivilegedMode-off
//
// Имена колонок содержат букву "ё" (Изменён), как принято в метаданных maERP.
// BSLLS:YoLetterUsage-off
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Макеты

// Макет печатной формы: изменённый пользователем, если его использование включено,
// иначе поставляемый с конфигурацией.
//
// Параметры:
//  ПутьКМакету - Строка - "Документ.РеализацияТоваровУслуг.Счёт" или "ОбщийМакет.АктОбОказанииУслуг"
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет печатной формы
//
Функция МакетПечатнойФормы(ПутьКМакету) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);

	УстановитьПривилегированныйРежим(Истина);
	Отбор = Новый Структура("Объект, ИмяМакета", Владелец.Объект, Владелец.ИмяМакета);
	Ресурсы = РегистрыСведений.ПользовательскиеМакетыПечати.Получить(Отбор);
	Если Ресурсы.Использование И ТипЗнч(Ресурсы.Макет) = Тип("ХранилищеЗначения") Тогда
		Макет = Ресурсы.Макет.Получить();
		Если ТипЗнч(Макет) = Тип("ТабличныйДокумент") Тогда
			Возврат Макет;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ПоставляемыйМакет(ПутьКМакету);

КонецФункции

// Макет, поставляемый с конфигурацией, без учёта пользовательских изменений.
//
// Параметры:
//  ПутьКМакету - Строка - см. МакетПечатнойФормы
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет печатной формы
//
Функция ПоставляемыйМакет(ПутьКМакету) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);
	Если Владелец.Объект = ИмяВладельцаОбщихМакетов() Тогда
		Возврат ПолучитьОбщийМакет(Владелец.ИмяМакета);
	КонецЕсли;

	Возврат МенеджерОбъекта(Владелец.Объект).ПолучитьМакет(Владелец.ИмяМакета);

КонецФункции

// Печатается ли форма по изменённому пользователем макету.
//
// Параметры:
//  ПутьКМакету - Строка - см. МакетПечатнойФормы
//
// Возвращаемое значение:
//  Булево - Истина, если используется пользовательский макет
//
Функция ИспользуетсяПользовательскийМакет(ПутьКМакету) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);

	УстановитьПривилегированныйРежим(Истина);
	Отбор = Новый Структура("Объект, ИмяМакета", Владелец.Объект, Владелец.ИмяМакета);
	Возврат РегистрыСведений.ПользовательскиеМакетыПечати.Получить(Отбор).Использование;

КонецФункции

// Сохраняет изменённый пользователем макет и включает его использование.
//
// Параметры:
//  ПутьКМакету - Строка            - см. МакетПечатнойФормы
//  Макет       - ТабличныйДокумент - изменённый макет
//
Процедура ЗаписатьПользовательскийМакет(ПутьКМакету, Макет) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);

	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Владелец.Объект;
	МенеджерЗаписи.ИмяМакета = Владелец.ИмяМакета;
	МенеджерЗаписи.Макет = Новый ХранилищеЗначения(Макет, Новый СжатиеДанных());
	МенеджерЗаписи.Использование = Истина;
	МенеджерЗаписи.ВерсияКонфигурации = Метаданные.Версия;
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Переключает печать между изменённым и поставляемым макетом, не удаляя изменённый.
//
// Параметры:
//  ПутьКМакету  - Строка - см. МакетПечатнойФормы
//  Использование - Булево - Истина - печатать по изменённому макету
//
Процедура УстановитьИспользованиеМакета(ПутьКМакету, Использование) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);

	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Владелец.Объект;
	МенеджерЗаписи.ИмяМакета = Владелец.ИмяМакета;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	МенеджерЗаписи.Использование = Использование;
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Удаляет изменённый макет: печать возвращается к поставляемому безвозвратно.
//
// Параметры:
//  ПутьКМакету - Строка - см. МакетПечатнойФормы
//
Процедура УдалитьПользовательскийМакет(ПутьКМакету) Экспорт

	Владелец = ВладелецМакета(ПутьКМакету);

	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Владелец.Объект;
	МенеджерЗаписи.ИмяМакета = Владелец.ИмяМакета;
	МенеджерЗаписи.Удалить();

КонецПроцедуры

// Все макеты печатных форм конфигурации с состоянием пользовательской правки.
// Источник данных формы МакетыПечатныхФорм.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//   * ПутьКМакету        - Строка - "Документ.X.Счёт"
//   * Объект             - Строка - полное имя владельца макета
//   * ПредставлениеОбъекта - Строка - синоним владельца
//   * ИмяМакета          - Строка - имя макета в метаданных
//   * ПредставлениеМакета - Строка - синоним макета
//   * Изменён            - Булево - есть запись пользовательского макета
//   * Используется       - Булево - печать идёт по изменённому макету
//   * ВерсияКонфигурации - Строка - версия конфигурации на момент правки
//   * ТребуетВнимания    - Булево - макет правился в более старой версии конфигурации
//
Функция МакетыПечатныхФорм() Экспорт

	Макеты = НоваяТаблицаМакетов();

	ДобавитьМакетыКоллекции(Макеты, Метаданные.ОбщиеМакеты, ИмяВладельцаОбщихМакетов());
	Коллекции = Новый Массив;
	Коллекции.Добавить(Метаданные.Документы);
	Коллекции.Добавить(Метаданные.Справочники);
	Коллекции.Добавить(Метаданные.Обработки);
	Коллекции.Добавить(Метаданные.Отчеты);
	Коллекции.Добавить(Метаданные.РегистрыСведений);
	Для Каждого Коллекция Из Коллекции Цикл
		Для Каждого ОбъектМетаданных Из Коллекция Цикл
			ДобавитьМакетыКоллекции(Макеты, ОбъектМетаданных.Макеты, ОбъектМетаданных.ПолноеИмя(), ОбъектМетаданных.Синоним);
		КонецЦикла;
	КонецЦикла;

	ДополнитьСостояниемПравки(Макеты);
	Макеты.Сортировать("ПредставлениеОбъекта Возр, ПредставлениеМакета Возр");
	Возврат Макеты;

КонецФункции

#КонецОбласти

#Область КомандыПечати

// Пустая коллекция команд печати; заполняется в ДобавитьКомандыПечати модуля менеджера.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//   * ИмяМакета       - Строка - имя макета объекта, оно же идентификатор команды
//   * Представление   - Строка - название печатной формы для пользователя
//   * Порядок         - Число  - порядок в списке печатных форм
//   * СразуНаПринтер  - Булево - печатать без окна предварительного просмотра
//   * ИмяПринтера     - Строка - принтер для печати без просмотра; пусто - принтер по умолчанию
//
Функция НоваяКоллекцияКомандПечати() Экспорт

	ТипСтрока = Новый ОписаниеТипов("Строка");

	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("ИмяМакета", ТипСтрока);
	Команды.Колонки.Добавить("Представление", ТипСтрока);
	Команды.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	Команды.Колонки.Добавить("СразуНаПринтер", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("ИмяПринтера", ТипСтрока);
	Возврат Команды;

КонецФункции

// Печатные формы объекта в порядке, заданном его модулем менеджера.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - "Документ.РеализацияТоваровУслуг"
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяКоллекцияКомандПечати; пустая, если у объекта нет печати
//
Функция КомандыПечатиОбъекта(ПолноеИмяОбъекта) Экспорт

	Команды = НоваяКоллекцияКомандПечати();
	Если ОбъектыСКомандамиПечати().Найти(ПолноеИмяОбъекта) = Неопределено Тогда
		Возврат Команды;
	КонецЕсли;

	МенеджерОбъекта(ПолноеИмяОбъекта).ДобавитьКомандыПечати(Команды);
	Команды.Сортировать("Порядок Возр, Представление Возр");
	Возврат Команды;

КонецФункции

// Объекты, у которых модуль менеджера поддерживает конвенцию печати
// (ДобавитьКомандыПечати и Печать). Пополняется при переводе объекта на подсистему.
//
// Возвращаемое значение:
//  Массив из Строка - полные имена объектов метаданных
//
Функция ОбъектыСКомандамиПечати() Экспорт

	Объекты = Новый Массив;
	Объекты.Добавить("Документ.ВозвратОтПокупателя");
	Объекты.Добавить("Документ.ВозвратОтПокупателяНалоговый");
	Объекты.Добавить("Документ.ВыплатаЗарплаты");
	Объекты.Добавить("Документ.ЗаказПокупателя");
	Объекты.Добавить("Документ.ЗаказПоставщику");
	Объекты.Добавить("Документ.КассоваяСмена");
	Объекты.Добавить("Документ.КорректировкаДолга");
	Объекты.Добавить("Документ.НалоговаяНакладная");
	Объекты.Добавить("Документ.НалоговаяНакладнаяПокупка");
	Объекты.Добавить("Документ.ОприходованиеТоваров");
	Объекты.Добавить("Документ.ОтгрузкаТовара");
	Объекты.Добавить("Документ.ПередачаВПереработку");
	Объекты.Добавить("Документ.ПеремещениеТоваров");
	Объекты.Добавить("Документ.ПлатёжнаяВедомостьНаАванс");
	Объекты.Добавить("Документ.ПоступлениеИзПереработки");
	Объекты.Добавить("Документ.ПоступлениеТоваровУслуг");
	Объекты.Добавить("Документ.ПредложениеПоставщика");
	Объекты.Добавить("Документ.ПриходныйКассовыйОрдер");
	Объекты.Добавить("Документ.РасходныйКассовыйОрдер");
	Объекты.Добавить("Документ.РеализацияТоваровУслуг");
	Объекты.Добавить("Документ.СверкаВзаиморасчётов");
	Объекты.Добавить("Документ.СписаниеТоваров");
	Объекты.Добавить("Документ.ТабельУчётаРабочегоВремени");
	Объекты.Добавить("Документ.УстановкаЦенНоменклатуры");
	Объекты.Добавить("РегистрСведений.Лиды");
	Возврат Объекты;

КонецФункции

#КонецОбласти

#Область ФормированиеПечатныхФорм

// Формирует печатные формы объектов по именам макетов.
//
// Параметры:
//  ИмяМенеджераПечати - Строка          - полное имя объекта, чей модуль менеджера печатает
//  ИменаМакетов       - Строка          - имена макетов через запятую
//  МассивОбъектов     - Массив          - ссылки на печатаемые объекты
//  ПараметрыПечати    - Структура       - произвольные параметры для модуля менеджера
//
// Возвращаемое значение:
//  Структура - результат формирования:
//   * КоллекцияПечатныхФорм - ТаблицаЗначений  - см. НоваяКоллекцияПечатныхФорм
//   * ОбъектыПечати         - СписокЗначений   - ссылка объекта - имя области табличного документа
//   * ПараметрыВывода       - Структура        - ЗаголовокФормы
//
Функция СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати = Неопределено) Экспорт

	Параметры = ?(ПараметрыПечати = Неопределено, Новый Структура, ПараметрыПечати);

	КоллекцияПечатныхФорм = НоваяКоллекцияПечатныхФорм(ИменаМакетов);
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура("ЗаголовокФормы", "");

	МенеджерОбъекта(ИмяМенеджераПечати).Печать(МассивОбъектов, Параметры, КоллекцияПечатныхФорм,
		ОбъектыПечати, ПараметрыВывода);

	Организация = ОрганизацияОбъектов(МассивОбъектов);
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			ЗаполнитьКартинкиОрганизации(ПечатнаяФорма.ТабличныйДокумент, Организация);
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	Результат.Вставить("ОбъектыПечати", ОбъектыПечати);
	Результат.Вставить("ПараметрыВывода", ПараметрыВывода);
	Возврат Результат;

КонецФункции

// Пустая коллекция печатных форм с заготовками строк по именам макетов.
//
// Параметры:
//  ИменаМакетов - Строка - имена макетов через запятую
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//   * ИмяМакета         - Строка            - имя макета объекта
//   * СинонимМакета     - Строка            - название печатной формы
//   * ТабличныйДокумент - ТабличныйДокумент  - результат формирования
//   * ПутьКМакету       - Строка            - полный путь макета для команды «Изменить макет»
//   * ИмяФайла          - Строка            - имя файла при сохранении
//
Функция НоваяКоллекцияПечатныхФорм(ИменаМакетов) Экспорт

	ТипСтрока = Новый ОписаниеТипов("Строка");

	Коллекция = Новый ТаблицаЗначений;
	Коллекция.Колонки.Добавить("ИмяМакета", ТипСтрока);
	Коллекция.Колонки.Добавить("СинонимМакета", ТипСтрока);
	Коллекция.Колонки.Добавить("ТабличныйДокумент", Новый ОписаниеТипов("ТабличныйДокумент"));
	Коллекция.Колонки.Добавить("ПутьКМакету", ТипСтрока);
	Коллекция.Колонки.Добавить("ИмяФайла", ТипСтрока);

	Для Каждого ИмяМакета Из СтрРазделить(ИменаМакетов, ",", Ложь) Цикл
		Строка = Коллекция.Добавить();
		Строка.ИмяМакета = СокрЛП(ИмяМакета);
	КонецЦикла;

	Возврат Коллекция;

КонецФункции

// Запрошена ли печать этого макета.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - см. НоваяКоллекцияПечатныхФорм
//  ИмяМакета             - Строка          - имя проверяемого макета
//
// Возвращаемое значение:
//  Булево - Истина, если макет нужно сформировать
//
Функция НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Экспорт

	Возврат КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета") <> Неопределено;

КонецФункции

// Помещает сформированный табличный документ в коллекцию печатных форм.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений    - см. НоваяКоллекцияПечатныхФорм
//  ИмяМакета             - Строка             - имя макета
//  СинонимМакета         - Строка             - название печатной формы для пользователя
//  ТабличныйДокумент     - ТабличныйДокумент  - результат формирования
//  ПутьКМакету           - Строка             - путь макета; пусто - «Документ.X.ИмяМакета» не определяется
//
Процедура ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент,
	ПутьКМакету = "") Экспорт

	Строка = КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета");
	Если Строка = Неопределено Тогда
		Строка = КоллекцияПечатныхФорм.Добавить();
		Строка.ИмяМакета = ИмяМакета;
	КонецЕсли;

	Строка.СинонимМакета = СинонимМакета;
	Строка.ТабличныйДокумент = ТабличныйДокумент;
	Строка.ПутьКМакету = ПутьКМакету;
	Если Не ЗначениеЗаполнено(Строка.ИмяФайла) Тогда
		Строка.ИмяФайла = СинонимМакета;
	КонецЕсли;

КонецПроцедуры

// Именует область табличного документа, относящуюся к одному объекту,
// чтобы окно печати умело переходить от печатной формы к документу.
//
// Параметры:
//  ТабличныйДокумент   - ТабличныйДокумент - формируемый документ
//  НомерСтрокиНачало   - Число             - первая строка области
//  ОбъектыПечати       - СписокЗначений    - соответствие ссылок именам областей
//  Ссылка              - ЛюбаяСсылка       - печатаемый объект
//
Процедура ЗадатьОбластьПечати(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка) Экспорт

	ИмяОбласти = "Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧГ=0");
	Область = ТабличныйДокумент.Область(НомерСтрокиНачало, , ТабличныйДокумент.ВысотаТаблицы);
	Область.Имя = ИмяОбласти;
	ОбъектыПечати.Добавить(Ссылка, ИмяОбласти);

КонецПроцедуры

#КонецОбласти

#Область ВыводПечатныхФорм

// Помощники вывода печатных форм, перенесённые из общего модуля ВыводПечатныхФорм:
// ими пользуются модули менеджеров при формировании конкретных форм.

// Строка реквизитов организации для подвала печатной формы: наименование, адрес,
// e-mail, IF, PATENTE, RC, CNSS, ICE (пустые реквизиты пропускаются).
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация документа.
//  Дата - Дата - дата, на которую берутся реквизиты.
//  Карточка - Структура, Неопределено - уже полученная Справочники.Контрагенты.ПолучитьКарточку(Организация, Дата);
//             если не передана, запрашивается здесь.
//
// Возвращаемое значение:
//  Строка - текст подвала в две строки.
//
Функция РеквизитыОрганизацииДляПодвала(Организация, Дата, Карточка = Неопределено) Экспорт
	Если Карточка = Неопределено Тогда
		Карточка = Справочники.Контрагенты.ПолучитьКарточку(Организация, Дата);
	КонецЕсли;
	Реквизиты = Карточка.Реквизиты;
	Наименование = ?(ЗначениеЗаполнено(Карточка.НаименованиеПолное), Карточка.НаименованиеПолное, Карточка.Наименование);
	Текст = СокрЛП(Наименование);
	Если ЗначениеЗаполнено(Карточка.АдресЮридический) Тогда
		Текст = Текст + " - " + СокрЛП(Карточка.АдресЮридический);
	КонецЕсли;
	Текст = Текст + Символы.ПС + СокрЛП(Реквизиты.EMail);
	Текст = Текст + РеквизитДляПодвала("IF", Реквизиты.NIF);
	Текст = Текст + РеквизитДляПодвала("PATENTE", Реквизиты.TaxeProfessionnelle);
	Текст = Текст + РеквизитДляПодвала("RC", Реквизиты.RC);
	Текст = Текст + РеквизитДляПодвала("CNSS", Реквизиты.CNSS);
	Текст = Текст + РеквизитДляПодвала("ICE", Реквизиты.ICE);
	Возврат Текст;
КонецФункции

// Выводит пустые строки, пока они вместе с областями внизу страницы помещаются на текущую страницу:
// число строк ограничено высотой страницы, а не константой.
//
// Параметры:
//  Таб - ТабличныйДокумент - формируемый документ.
//  ОбластьПустойСтроки - ТабличныйДокумент - область макета с пустой строкой.
//  ОбластиВнизу - Массив из ТабличныйДокумент - области, которые должны поместиться после пустых строк.
//
Процедура ДобитьСтраницуПустымиСтроками(Таб, ОбластьПустойСтроки, ОбластиВнизу) Экспорт
	МасОбластей = Новый Массив;
	МасОбластей.Добавить(ОбластьПустойСтроки);
	Для Каждого Область Из ОбластиВнизу Цикл
		МасОбластей.Добавить(Область);
	КонецЦикла;
	Предохранитель = 500; // на случай области нулевой высоты, когда ПроверитьВывод никогда не вернёт Ложь
	Пока Предохранитель > 0 И Таб.ПроверитьВывод(МасОбластей) Цикл
		Таб.Вывести(ОбластьПустойСтроки);
		Предохранитель = Предохранитель - 1;
	КонецЦикла;
КонецПроцедуры

// Сумма прописью в валюте регламентированного учёта на языке текущего сеанса.
//
// Параметры:
//  Сумма - Число - сумма.
//
// Возвращаемое значение:
//  Строка - сумма прописью; локализация: ru - ru_RU, en - en_US, иначе fr_CA.
//
Функция СуммаПрописьюВВалютеУчета(Сумма) Экспорт
	КодЯзыка = ТекущийЯзык().КодЯзыка;
	Если КодЯзыка = "ru" Тогда
		Локализация = Перечисления.Локализации.ru_RU;
	ИначеЕсли КодЯзыка = "en" Тогда
		Локализация = Перечисления.Локализации.en_US;
	Иначе
		Локализация = Перечисления.Локализации.fr_CA;
	КонецЕсли;
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Возврат Справочники.Валюты.СформироватьСуммуПрописью(Сумма, Валюта, Локализация);
КонецФункции

// Размер и положение картинки (печати, факсимиле, подписи) в области макета
// с поправкой на масштаб печати и собственный масштаб картинки.
//
// Параметры:
//  Картинка        - Рисунок           - рисунок области макета
//  Ширина          - Число             - ширина картинки, мм
//  Высота          - Число             - высота картинки, мм
//  Верх            - Число             - положение низа картинки от верха области, мм
//  Лево            - Число             - отступ слева, мм
//  МасштабПечати   - Число, Неопределено - масштаб печати документа, %; Неопределено - не учитывать
//  МасштабКартинки - Число             - собственный масштаб картинки, %
//
Процедура РассчитатьРазмерИРасположениеКартинки(Картинка, Знач Ширина, Знач Высота, Знач Верх, Знач Лево,
	Знач МасштабПечати = Неопределено, МасштабКартинки = 100) Экспорт

	ПолныйМасштаб = 100;

	// Рассчитываем размеры относительно масштаба картинки
	Ширина = Ширина / ПолныйМасштаб * МасштабКартинки;
	Высота = Высота / ПолныйМасштаб * МасштабКартинки;
	// Рассчитаем размеры относительно масштаба печати
	Если МасштабПечати <> Неопределено Тогда
		Ширина = Ширина * ПолныйМасштаб / МасштабПечати;
		Высота = Высота * ПолныйМасштаб / МасштабПечати;
		Верх = Верх * ПолныйМасштаб / МасштабПечати;
		Лево = Лево * ПолныйМасштаб / МасштабПечати;
	КонецЕсли;
	// Рассчитаем положение относительно низа картинки
	Верх = Верх - Высота;
	// Устанавливаем значения
	Картинка.Верх = Верх;
	Картинка.Лево = Лево;
	Картинка.Ширина = Ширина;
	Картинка.Высота = Высота;	
КонецПроцедуры

// Подставляет логотип организации в рисунок области макета: в рисунок с именем «Логотип»,
// а если его нет - в первый рисунок области.
//
// Параметры:
//  Область - ТабличныйДокумент - область макета с рисунком под логотип.
//  Логотип - ХранилищеЗначения, ДвоичныеДанные, Неопределено - логотип организации
//            (реквизит Организации.Логотип); при пустом значении рисунок не меняется.
//
Процедура УстановитьЛоготип(Область, Логотип) Экспорт
	Рисунок = Область.Рисунки.Найти("Логотип");
	Если Рисунок = Неопределено И Область.Рисунки.Количество() > 0 Тогда
		Рисунок = Область.Рисунки[0];
	КонецЕсли;
	Если Рисунок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Данные = ?(ТипЗнч(Логотип) = Тип("ХранилищеЗначения"), Логотип.Получить(), Логотип);
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Рисунок.Картинка = Новый Картинка(Данные);
	КонецЕсли;
КонецПроцедуры

// Дополняет таблицу товаров печатной формы данными номенклатуры: артикулом,
// единицей измерения, номером ГТД и страной происхождения.
//
// Запрос перенесён из ВыводПечатныхФорм как есть, вместе с разыменованием полей
// через точку; переписать его на соединения - в docs/TECHDEBT.md.
// BSLLS:QueryNestedFieldsByDot-off
//
// Параметры:
//  ТЗТовары - ТаблицаЗначений - строки товаров документа
//
// Возвращаемое значение:
//  ТаблицаЗначений - те же строки, дополненные данными номенклатуры
//
Функция СформироватьТабличныеДанные(ТЗТовары) Экспорт
	Если ТЗТовары.Колонки.Найти("Серия") = Неопределено Тогда
		ТЗТовары.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	                      |	ВЫРАЗИТЬ(ТЗ.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	                      |	ВЫРАЗИТЬ(ТЗ.КоличествоУпаковок КАК ЧИСЛО) КАК КоличествоУпаковок,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество,
	                      |	ВЫРАЗИТЬ(ТЗ.Цена КАК ЧИСЛО) КАК Цена,
	                      |	ВЫРАЗИТЬ(ТЗ.Сумма КАК ЧИСЛО) КАК Сумма,
	                      |	ВЫРАЗИТЬ(ТЗ.СуммаСНДС КАК ЧИСЛО) КАК СуммаСНДС,
	                      |	ВЫРАЗИТЬ(ТЗ.СтавкаНДС КАК Справочник.СтавкиНДС) КАК СтавкаНДС,
	                      |	ВЫРАЗИТЬ(ТЗ.СуммаНДС КАК ЧИСЛО) КАК СуммаНДС
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.НомерСтроки КАК НомерСтроки,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Номенклатура.Код КАК НоменклатураКод,
	                      |	ВЗ.Номенклатура.Артикул КАК НоменклатураАртикул,
	                      |	ВЫБОР
	                      |		КОГДА СОКРЛП(ВЗ.Номенклатура.НаименованиеПолное) = """"
	                      |			ТОГДА ВЗ.Номенклатура.Наименование
	                      |		ИНАЧЕ ВЗ.Номенклатура.НаименованиеПолное
	                      |	КОНЕЦ КАК НоменклатураПредставление,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Серия КАК Серия,
	                      |	ВЗ.Упаковка КАК Упаковка,
	                      |	ВЗ.Единица КАК Единица,
	                      |	ВЗ.Единица.Код КАК ЕдиницаИзмеренияКод,
	                      |	ВЗ.Единица.Наименование КАК ЕдиницаИзмеренияНаименование,
	                      |	ВЗ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.Цена КАК Цена,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	ВЗ.СуммаСНДС КАК СуммаСНДС,
	                      |	ВЗ.СтавкаНДС КАК СтавкаНДС,
	                      |	ВЗ.СуммаНДС КАК СуммаНДС,
	                      |	ВЗ.Серия.НомерГТД КАК НомерГТД,
	                      |	ВЗ.Серия.СтранаПроисхождения КАК СтранаПроисхождения,
	                      |	ВЗ.Серия.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.НомерСтроки КАК НомерСтроки,
	                      |		ВТ.Номенклатура КАК Номенклатура,
	                      |		ВТ.Характеристика КАК Характеристика,
	                      |		ВТ.Серия КАК Серия,
	                      |		ВТ.Упаковка КАК Упаковка,
	                      |		ВЫБОР
	                      |			КОГДА ВТ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |				ТОГДА ВТ.Номенклатура.Единица
	                      |			ИНАЧЕ ВТ.Упаковка.Единица
	                      |		КОНЕЦ КАК Единица,
	                      |		ВТ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |		ВТ.Количество КАК Количество,
	                      |		ВТ.Цена КАК Цена,
	                      |		ВТ.Сумма КАК Сумма,
	                      |		ВТ.СуммаСНДС КАК СуммаСНДС,
	                      |		ВТ.СтавкаНДС КАК СтавкаНДС,
	                      |		ВТ.СуммаНДС КАК СуммаНДС
	                      |	ИЗ
	                      |		ВТ КАК ВТ) КАК ВЗ");
	Запрос.УстановитьПараметр("ТЗ", ТЗТовары);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

#КонецОбласти

#Область КартинкиОрганизации

// Подставляет в готовую печатную форму картинки организации: рисунки макета с именами
// «Логотип», «ПечатьОрганизации» и «Подпись» заполняются из карточки организации.
// Рисунков с такими именами в макете может не быть - тогда процедура ничего не делает.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - готовая печатная форма
//  Организация       - СправочникСсылка.Организации - организация документа; пустая ссылка - выход
//
// См. также УстановитьЛоготип - подстановка логотипа в одну область макета при её выводе.
//
Процедура ЗаполнитьКартинкиОрганизации(ТабличныйДокумент, Организация) Экспорт

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Логотип, ПечатьОрганизации");
	УстановитьПривилегированныйРежим(Ложь);

	Картинки = Новый Соответствие;
	Картинки.Вставить("Логотип", КартинкаИзХранилища(Реквизиты.Логотип));
	Картинки.Вставить("ПечатьОрганизации", КартинкаИзХранилища(Реквизиты.ПечатьОрганизации));

	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		Если Рисунок.ТипРисунка <> ТипРисункаТабличногоДокумента.Картинка Тогда
			Продолжить;
		КонецЕсли;
		Картинка = Картинки[Рисунок.Имя];
		Если Картинка <> Неопределено Тогда
			Рисунок.Картинка = Картинка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Часть строки подвала: метка и значение реквизита; пустой реквизит пропускается.
//
// Параметры:
//  Метка    - Строка - название реквизита в подвале
//  Значение - Строка - значение реквизита
//
// Возвращаемое значение:
//  Строка - фрагмент подвала или пустая строка
//
Функция РеквизитДляПодвала(Метка, Значение)
	Возврат ?(ЗначениеЗаполнено(Значение), " - " + Метка + ": " + СокрЛП(Значение), "");
КонецФункции

// Разбирает путь к макету на владельца и имя макета.
//
// Параметры:
//  ПутьКМакету - Строка - "Документ.X.ИмяМакета" или "ОбщийМакет.ИмяМакета"
//
// Возвращаемое значение:
//  Структура - Объект (Строка), ИмяМакета (Строка)
//
Функция ВладелецМакета(ПутьКМакету)

	ПозицияТочки = СтрНайти(ПутьКМакету, ".", НаправлениеПоиска.СКонца);
	Если ПозицияТочки > 1 Тогда
		Владелец = Лев(ПутьКМакету, ПозицияТочки - 1);
		ИмяМакета = Сред(ПутьКМакету, ПозицияТочки + 1);
		Если ЗначениеЗаполнено(ИмяМакета)
			И (Владелец = ИмяВладельцаОбщихМакетов() Или СтрНайти(Владелец, ".") > 0) Тогда
			Возврат Новый Структура("Объект, ИмяМакета", Владелец, ИмяМакета);
		КонецЕсли;
	КонецЕсли;

	ШаблонОшибки = НСтр("ru = 'Неверный путь к макету печатной формы: %1';
		|fr = 'Chemin incorrect vers le modèle du formulaire imprimable : %1';
		|en = 'Invalid path to the print form template: %1';
		|es = 'Ruta incorrecta a la plantilla del formulario de impresión: %1'");
	ВызватьИсключение СтрШаблон(ШаблонОшибки, ПутьКМакету);

КонецФункции

// Имя владельца общих макетов в путях и в регистре.
//
// Возвращаемое значение:
//  Строка - "ОбщийМакет"
//
Функция ИмяВладельцаОбщихМакетов()

	Возврат "ОбщийМакет";

КонецФункции

// Менеджер объекта метаданных по его полному имени.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - "Документ.РеализацияТоваровУслуг"
//
// Возвращаемое значение:
//  ДокументМенеджер, СправочникМенеджер, ОбработкаМенеджер, ОтчетМенеджер, РегистрСведенийМенеджер - менеджер
//
Функция МенеджерОбъекта(ПолноеИмяОбъекта)

	КоллекцииМенеджеров = Новый Соответствие;
	КоллекцииМенеджеров.Вставить("Документ", Документы);
	КоллекцииМенеджеров.Вставить("Справочник", Справочники);
	КоллекцииМенеджеров.Вставить("Обработка", Обработки);
	КоллекцииМенеджеров.Вставить("Отчет", Отчеты);
	КоллекцииМенеджеров.Вставить("РегистрСведений", РегистрыСведений);
	КоллекцииМенеджеров.Вставить("ЖурналДокументов", ЖурналыДокументов);

	ПозицияТочки = СтрНайти(ПолноеИмяОбъекта, ".");
	Если ПозицияТочки > 1 Тогда
		Коллекция = КоллекцииМенеджеров[Лев(ПолноеИмяОбъекта, ПозицияТочки - 1)];
		Если Коллекция <> Неопределено Тогда
			Возврат Коллекция[Сред(ПолноеИмяОбъекта, ПозицияТочки + 1)];
		КонецЕсли;
	КонецЕсли;

	ШаблонОшибки = НСтр("ru = 'Печать не поддерживается для объекта: %1';
		|fr = 'L''impression n''est pas prise en charge pour l''objet : %1';
		|en = 'Printing is not supported for the object: %1';
		|es = 'La impresión no es compatible con el objeto: %1'");
	ВызватьИсключение СтрШаблон(ШаблонОшибки, ПолноеИмяОбъекта);

КонецФункции

// Организация печатаемых объектов: берётся у первого объекта, у которого есть такой реквизит.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на печатаемые объекты
//
// Возвращаемое значение:
//  СправочникСсылка.Организации, Неопределено - организация или Неопределено
//
Функция ОрганизацияОбъектов(МассивОбъектов)

	Для Каждого Объект Из МассивОбъектов Цикл
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)) Тогда
			Продолжить;
		КонецЕсли;
		МетаданныеОбъекта = Объект.Метаданные();
		Если МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Организация");
		Если ЗначениеЗаполнено(Организация) Тогда
			Возврат Организация;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Картинка из реквизита-хранилища значения.
//
// Параметры:
//  Хранилище - ХранилищеЗначения, Произвольный - реквизит организации
//
// Возвращаемое значение:
//  Картинка, Неопределено - картинка или Неопределено, если хранилище пустое
//
Функция КартинкаИзХранилища(Хранилище)

	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Данные = Хранилище.Получить();
	Если ТипЗнч(Данные) = Тип("Картинка") Тогда
		Возврат Данные;
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Возврат Новый Картинка(Данные);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Пустая таблица макетов печатных форм.
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. МакетыПечатныхФорм
//
Функция НоваяТаблицаМакетов()

	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");

	Макеты = Новый ТаблицаЗначений;
	Макеты.Колонки.Добавить("ПутьКМакету", ТипСтрока);
	Макеты.Колонки.Добавить("Объект", ТипСтрока);
	Макеты.Колонки.Добавить("ПредставлениеОбъекта", ТипСтрока);
	Макеты.Колонки.Добавить("ИмяМакета", ТипСтрока);
	Макеты.Колонки.Добавить("ПредставлениеМакета", ТипСтрока);
	Макеты.Колонки.Добавить("Изменён", ТипБулево);
	Макеты.Колонки.Добавить("Используется", ТипБулево);
	Макеты.Колонки.Добавить("ВерсияКонфигурации", ТипСтрока);
	Макеты.Колонки.Добавить("ТребуетВнимания", ТипБулево);
	Возврат Макеты;

КонецФункции

// Добавляет в таблицу табличные макеты одной коллекции метаданных.
//
// Параметры:
//  Макеты            - ТаблицаЗначений    - пополняемая таблица
//  МакетыМетаданных  - Коллекция          - коллекция макетов объекта или общих макетов
//  ИмяВладельца      - Строка             - полное имя владельца
//  СинонимВладельца  - Строка             - представление владельца; пусто - берётся имя
//
Процедура ДобавитьМакетыКоллекции(Макеты, МакетыМетаданных, ИмяВладельца, СинонимВладельца = "")

	Для Каждого МакетМетаданных Из МакетыМетаданных Цикл
		Если МакетМетаданных.ТипМакета <> Метаданные.СвойстваОбъектов.ТипМакета.ТабличныйДокумент Тогда
			Продолжить;
		КонецЕсли;
		Строка = Макеты.Добавить();
		Строка.Объект = ИмяВладельца;
		Строка.ПредставлениеОбъекта = ?(ЗначениеЗаполнено(СинонимВладельца), СинонимВладельца, ИмяВладельца);
		Строка.ИмяМакета = МакетМетаданных.Имя;
		Строка.ПредставлениеМакета = ?(ЗначениеЗаполнено(МакетМетаданных.Синоним),
			МакетМетаданных.Синоним, МакетМетаданных.Имя);
		Строка.ПутьКМакету = ИмяВладельца + "." + МакетМетаданных.Имя;
	КонецЦикла;

КонецПроцедуры

// Проставляет в таблице макетов состояние пользовательской правки.
//
// Параметры:
//  Макеты - ТаблицаЗначений - таблица макетов по метаданным
//
Процедура ДополнитьСостояниемПравки(Макеты)

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Макеты.Объект КАК Объект,
	|	Макеты.ИмяМакета КАК ИмяМакета,
	|	Макеты.Использование КАК Использование,
	|	Макеты.ВерсияКонфигурации КАК ВерсияКонфигурации
	|ИЗ
	|	РегистрСведений.ПользовательскиеМакетыПечати КАК Макеты";

	ВерсияПрограммы = Метаданные.Версия;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Объект, ИмяМакета", Выборка.Объект, Выборка.ИмяМакета);
		НайденныеСтроки = Макеты.НайтиСтроки(Отбор);
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Изменён = Истина;
			Строка.Используется = Выборка.Использование;
			Строка.ВерсияКонфигурации = Выборка.ВерсияКонфигурации;
			Строка.ТребуетВнимания = Выборка.Использование
				И ОбновлениеПрограммы.СравнитьВерсии(Выборка.ВерсияКонфигурации, ВерсияПрограммы) < 0;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
